import React, { useState } from 'react';
import { useSelector } from 'react-redux';
import type { RootState } from '../../../store/store';
import { toast } from 'react-toastify';
import 'react-toastify/dist/ReactToastify.css';

function GuaranteePage(): JSX.Element {
  const [buttonText, setButtonText] = useState('Отправить заявку в Telegram');
  const user = useSelector((store: RootState) => store.auth.user);

  async function sendMessageToTelegram(): Promise<void> {
	if(!user){
		toast.error('Для отправки необходимо авторизоваться');
	  }else{
    const token: string = import.meta.env.VITE_TELEGRAM_BOT_TOKEN;
    const chat_id: string = import.meta.env.VITE_TELEGRAM_CHAT_ID;
    const message = `Пользователь ${user?.name} оставил заявку на консультацию со страницы проверки гарантии, телефон: ${user?.phone}, email: ${user?.email}`;
    const url = `https://api.telegram.org/bot${token}/sendMessage?chat_id=${chat_id}&text=${encodeURIComponent(message)}`;

    try {
      const response = await fetch(url, { method: 'GET' });
      const data = await response.json();
      if (data.ok) {
        setButtonText('Заявка отправлена');
      }
    } catch (error) {
      console.error(error);
    }
  }
}


 
  

  return (
    <>
     <section className="garant" id="garant">
			<div className="container">
				<div className="bread q">
					<a href="main.html">
						Главная
					</a>
					<a href="#">
						Каталог
					</a>
					<a href="#">
						Проверить гарантию
					</a>
				</div>
				<h1>
					Гарантийное обслуживание
				</h1>
				<p className="garant__txt">
					В компании PitBit Mining мы стремимся обеспечить высокое качество обслуживания наших клиентов на каждом
					этапе использования майнингового оборудования. После приобретения оборудования важно понимать, что наше
					взаимодействие с вами не заканчивается на этапе продажи. В случаях выявления заводского брака или
					обнаружения неисправностей аппаратов, мы рекомендуем нашим клиентам пользоваться услугами гарантийных
					сервисов. Также, если гарантийный срок оборудования истек, мы предлагаем услуги платного ремонта, чтобы
					вы могли быть уверены в надежной и бесперебойной работе ваших устройств.
				</p>
			</div>
			<div className="garant-area">
				<div className="container">
					<h2>
						Гарантийное обслуживание Antminer от Bitmain
					</h2>
					<p className="garant-area__text">
						Покупая у нас майнеры Antminer от Bitmain, вы получаете заводскую гарантию на оборудование и
						возможность воспользоваться сервисными центрами компании Bitmain для ремонта и обслуживания. В случае
						возникновения проблем с оборудованием в рамках гарантийного периода, наши клиенты могут рассчитывать
						на оперативную и квалифицированную поддержку этого сервиса.
					</p>
					<div className="garant-area__box">
						<h2>
							<span className="or">
								Шаг 1.
							</span>
							Регистрация на сайте Bitmain
						</h2>
						<ul>
							<li>
								1. Вам необходимо перейти на вебсайт bitmain.com и нажать на кнопку с изображением силуэта
								человека. В выпадающем меню необходимо выбрать пункт «Sign Up».
							</li>
							<li>
								2. Вас перенаправит на страницу регистрации, где на выбор доступна регистрация по номеру
								телефона или Email. Мы настоятельно рекомендуем использовать именно E-mail для этого. Важно
								проверить гарантию на ваше устройство. Проверить оставшееся количество дней можно в разделе
								«Customer Support»  &gt; «Warranty Check».
							</li>
							<li>
								У Вас должно оставаться не менее 15 дней гарантии, не считая срок доставки. Все серийные номера
								должны быть на месте, без повреждений и на оригинальных наклейках. Контрольная плата, блок
								питания и все хэшплаты должны соответствовать аппарату, в противном случае с него будет снята
								гарант
							</li>
							<li>
								<div className="garant-area__flex q">
									<img src="img/photo1.png" alt="" className="garant-area__pic1"/>
									<img src="img/photo2.png" alt=""/>
								</div>
							</li>
							<li>
								3. После того как вы ввели телефон/почту и нажали «Register Now», появится
								дополнительное(второе) окно куда необходимо ввести код подтверждения. В случае если Вы выбрали
								регистрация по телефону, вам придет СМС с шестизначным кодом. Если же вы предпочли использовать
								электронную почту, письмо с кодом придет в течение 5 минут. Вам остается только придумать пароль
								и ввести его в самое нижнее окно
							</li>
							<li>
								4. После того как Вы ввели все данные, вам необходимо завершить регистрацию нажав кнопку
								«Verification and complete registration»
							</li>
							<li>
								<div className="garant-area__flex">
									<img src="img/photo3.png" alt=""/>
								</div>
							</li>
						</ul>
					</div>

					<div className="garant-area__box">
						<h2>
							<span className="or">
								Шаг 2.
							</span>
							Заполнение заявки на ремонт
						</h2>
						<ul>
							<li>
								1. Чтобы открыть раздел оформления заявки на ремонт, на сайте Bitmain наведите курсор мыши на
								пункт «Customer Support», после чего выберите в выпадающем списке «Repair Request».
							</li>
							<li>
								2. В появившемся окне, вы соглашаетесь что отправляете на ремонт менее 50 единиц оборудования,
								кнопкой «Confirm». После чего нажимаете кнопку «Apply for Repair». Обязательно прочитайте
								правила гарантийного ремонта и проверьте срок длительности гарантии на ваше устройство.
								Проверить оставшееся количество дней можно в разделе «Customer Support» &gt; «Warranty Check»
							</li>
							<li>
								У Вас должно оставаться не менее 15 дней гарантии, не считай срок доставки. Все серийные номера
								должны быть на месте, без повреждений и на оригинальных наклейках.
							</li>
							<li>
								Контрольная плата, блок питания и все хэшплаты должны соответствовать аппарату, в противном
								случае с него будет снята гарантия.
							</li>
							<li>
								3. Следующим шагом является добавление устройств подлежащих ремонту в пункте «Item Information»,
								для этого Вам достаточно нажать кнопку «Add Device». В открывшемся меню Вы выбираете тип (Туре)
								устройства - Unit. Принимаются в ремонт только цельные аппараты, так как ремонт отдельных
								компонентов значительно увеличивает сроки ремонта. В пункте (Item) необходимо выбрать конкретную
								модель устройства. В третьем пункте (Quantity) необходимо указать количество оборудования. В
								четвертом поле (Remark) можно оставить примечание.
							</li>
							<li>
								4. Вы можете добавлять несколько разных устройств, но обязательно выбирайте верную модель
								устройства. Сервисные центры в России пока принимают не все модели, поэтому после добавления
								устройства проверьте доступность в графе Repairable Repair Site (должна появиться надпись
								RUSIRKT2, RUS-MOS или RUS-Kazan).
							</li>
							<li>
								5. В пункте «Logistics Information» необходимо указать трек-номер (Tracking No.), которым Вы
								отправляете оборудование в сервисный центр. Вы можете заранее оформить отправку через вебсайт
								Транспортной Компании (ТК) и получить трек-номер, даже если отправка назначена на другую дату. В
								графе (Courier) необходимо выбрать какой ТК вы отправляете оборудование - CDEK или для всех
								остальных ТК. <br/>
								Указывайте только реальный трек-номер. <br/>
								Доставка в сервисный центр организуется и оплачивается за счет клиента - «до адреса получателя»
								и «С разгрузочными работами». <br/>
								Используйте оригинальные коробки, ложементы и антистатические пакеты от аппаратов. <br/>
								Указывайте время доставки с 14:00 до 17:00.
							</li>
							<li>
								<div className="garant-area__flex q">
									<img src="img/photo4.png" alt="" className="garant-area__pic2"/>
									<img src="img/photo5.png" alt=""/>
								</div>
							</li>
							<li>
								6. Очень важным шагом является заполнение контактной информации в разделе «Customer
								Information», где первым делом нужно нажать кнопку «+ New Address». В появившемся окне,
								необходимо заполнить все поля красным символом *. Пожалуйста, используйте свои полные данные и
								актуальный номер телефона, по которому можно связаться для уточнения деталей доставки. <br/>
								После заполнения всех обязательных полей, необходимо нажать кнопку «Submit».
							</li>
							<li>
								7. Если Вы ввели все данные корректно, в пункте «Repair Site Information» появится выбор
								RUSIRKT2 (Иркутск), RUS-MOS(Москва) и RUS-Kazan(Казань). Вам необходимо выбрать нужную нажатием,
								после чего появятся контактные данные сервисного центра.
							</li>
							<li>
								8. Последним пунктом является «Return Logistics Information» - выбор ТК, которой Ваше
								оборудование будет доставлено обратно. На данный момент доступен лишь СDЕК, однако по Вашему
								компания может организовать отправку Вашего оборудования другими ТК. Сервис оплачивает доставку
								обратно до ближайшего к Вам терминала ТК. Дополнительная упаковка и обрешетка за счет клиента.
								Отправка оборудования обратно два раза в неделю - среда и пятница.
							</li>
							<li>
								В поле «Remark» необходимо оставить серийный номер устройства SN, а так же информацию о поломке.
								В случае если вся информация заполнена верно, после нажатия Submit появится новое окно «Ticket
								has been submitted successfully»
							</li>
							<li>
								<div className="garant-area__flex q">
									<div className="garant-area__left">
										<img src="img/photo6.png" alt=""/>
									</div>
									<div className="garant-area__right">
										<img src="img/photo7.png" alt=""/>
										<img src="img/photo8.png" alt=""/>
									</div>
								</div>
							</li>
							<li>
								После оформления заявки откройте свой тикет (достаточно нажать View Ticket Details),
								распечайтезаявку (Print), при необходимости дополните её информацией, укажите дату и поставьте
								подписьвнизу. Вложите подписанную заявку в коробку с устройством в качестве сопроводительного
								листа.
							</li>
						</ul>
					</div>
				</div>
			</div>
			<div className="container">
				<h2 className="garant__title">
					основные действия для получения гарантийного ремонта:
				</h2>
				<p className="garant__txt">
					Самостоятельно проверьте гарантийный срок оборудования и оформите заявку на сайте компании
					BITMAIN--&gt;Customer TicketID. Support --&gt;Repair Request, получите ответное сообщение с регистрационным
					номером. Сообщите нам регистрационный номер заявки в Bitmain и получите необходимую информацию для сдачи
					оборудования на гарантийное обслуживание в нашей компании. Пожалуйста, напишите сообщение в мессенджере
					WhatsApp абоненту +7 996 968-09-31. Отправьте оборудование транспортной компанией или доставьте
					самостоятельно в пункт приёма, согласно полученным от нас инструкциям. Дождитесь подтверждения о приёме
					на диагностику и ремонт. После проведения гарантийного обслуживания мы сообщим о готовности к выдаче или
					организуем отправку оборудования из сервисного центра.
				</p>
			</div>
			<div className="garant-area">
				<div className="container">
					<h2>
						Гарантийное обслуживание Whatsminer от MicroBT
					</h2>
					<p className="garant-area__text">
						Майнеры Whatsminer от MicroBT также сопровождаются гарантийным обслуживанием через официальные
						сервисные центры. Процесс гарантийногообслуживания Whatsminer аналогичен процессу обслуживания
						Antminer, что позволяет нам обеспечивать высокий уровень поддержки для всех наших клиентов.
					</p>
					<div className="garant-area__box">
						<h2>
							<span className="or">
								Шаг 1.
							</span>
							Обращение в Whatsminer
						</h2>
						<ul>
							<li>
								Обратитесь в официальную техническую службу MicroBT-Whatsminer, чтобы убедиться в конкретной
								поломке/ошибке и получить подтверждение о возможности гарантийного ремонта данного случая.
								Контакты для связи с Заводом по гарантийному обращению: Официальный WeChat: whatsminer_service
								Telegram: https://t.me/Whatsminer_Aftersales
							</li>
							<li>
								Через некоторое время после того как вы списались с представителем Whatsminer вас добавят в чат
								с отделом постпродажного обслуживания. В этом чате нужно описать свою проблему, а также
								предоставить все необходимые данные: Код ошибки, Логи устройства, Серийный номер оборудования,
								Серийный номер блока питания, МАС адрес контрольной платы, Серийный номер хэшплаты. Фото примеры
								будут прикреплены ниже.
							</li>
							<li>
								Пример описания ошибок (Hello, SN Miner: Серийный номер майнера. Error 540.(Номер ошибки моет
								отличаться). Hello, SN PSU Серийный номер блока питания.The miner does not turn on. (Ошибка
								блока питания. Может присутствовать номер ошибки в поле Errors или майнер совсем не
								запускается)).
							</li>
							<li>
								<div className="garant-area__row q">
									<img src="img/photo9.png" alt=""/>
									<img src="img/photo10.png" alt=""/>
									<img src="img/photo11.png" alt=""/>
									<img src="img/photo12.png" alt=""/>
									<img src="img/photo13.png" alt=""/>
									<img src="img/photo14.png" alt=""/>
									<img src="img/photo15.png" alt=""/>
								</div>
							</li>
						</ul>
					</div>
					<div className="garant-area__box">
						<h2>
							<span className="or">
								Шаг 2.
							</span>
							Регистрация на сайте
						</h2>
						<ul>
							<li>
								После того как вы связались с технической поддержкой в чате и получили все нужные данные для
								оформления заявки, вам требуется зарегистрироваться на сайте Whatsminer.
							</li>
							<li>
								В правом верхнем углу веб-страницы сайта вы увидите кнопку Login, перейдя по ней вам должно
								открыться окно входа и регистрации на сайте. При регистрации вы должны указать свои ФИО, номер
								телефона, адрес электронной почты (вам нужно сразу подтвердить почту, для этого нажмите кнопку
								Send, дождитесь кода подтверждения и вставьте его в следующую графу), придумайте пароль и
								напишите его еще раз во второй графе. Пароль не должен содержать пробелы, длинна должна быть
								между 8-16 символами, а также пароль должен содержать буквы, цифры и специальные знаки. После
								всего вам остается только нажать кнопку Register.
							</li>
							<li>
								<div className="garant-area__flex q">
									<img src="img/photo16.png" alt="" className="garant-area__pic2"/>
									<img src="img/photo17.png" alt="" className="garant-area__pic7"/>
								</div>
							</li>
						</ul>
					</div>
					<div className="garant-area__box">
						<h2>
							<span className="or">
								Шаг 3.
							</span>
							Оформление заявки
						</h2>
						<ul>
							<li>
								Следующий ваш шаг это перейти по вкладке Support и нажать кнопку Repair. В новом окне вы
								нажимаете кнопку Start Repair и уже во всплывающем окне ставите галочку и подтверждаете
								оформление заявки по всем правилам Whatsminer нажав Confirm. В следующем окне вас встретит выбор
								сервисного центра. Если вы из Москвы выбирайте пункт с названием M-R. Если же вы из
								другого города России, то рекомендуем вам проконсультироваться с сотрудниками технической
								поддержки касательно выбора требуемого сервисного центра. Ниже также будут прикреплены скриншоты
								по заполнению заявки на ремонт. После завершения оформления Order ID должен быть сохранен или
								записан. (При желании его всегда можно посмотреть по ссылке: ( https://
								www.whatsminer.com/src/views/order-center.html ))
							</li>
							<li>
								<div className="garant-area__flex q">
									<div className="garant-area__left garant-area__left2">
										<img src="img/photo18.png" alt="" className="garant-area__pic3"/>
										<img src="img/photo19.png" alt=""/>
									</div>
									<img src="img/photo20.png" alt="" className="garant-area__pic"/>
								</div>
							</li>
							<li>
								<div className="garant-area__flex garant-area__flex2 q">
									<div className="garant-area__left">
										<img src="img/photo21.png" alt=""/>
									</div>
									<div className="garant-area__right">
										<img src="img/photo22.png" alt="" className="garant-area__pic5"/>
										<img src="img/photo23.png" alt=""/>
									</div>
								</div>
							</li>
						</ul>
					</div>
				</div>
			</div>
			<div className="container">
				<h2 className="garant__title">
					Платное постпродажное обслуживание и ремонт
				</h2>
				<p className="garant__txt garant__txt2">
					Как уже и было сказано ранее, PitBit Mining предлагает платное постпродажное обслуживание и ремонт вашего
					майнингового оборудования. Наши высококвалифицированные специалисты готовы помочь вам решить любые
					технические проблемы, обеспечивая минимальные простои и максимальную эффективность вашего майнингового
					бизнеса.
				</p>
				<p className="garant__sub">
					Основные этапы платного ремонта:
				</p>
				<ul className="garant__list">
					<li>
						Диагностика оборудования: Мы проведем полную диагностику для выявления всех неисправностей.
					</li>
					<li>
						Согласование стоимости: После диагностики мы обсудим с вами стоимость ремонта, включая все необходимые
						работы и запчасти.
					</li>
					<li>
						Ремонтные работы: После вашего согласия наши специалисты приступят кремонту, используя только
						качественные и оригинальные запчасти.
					</li>
					<li>
						Тестирование и возврат: После завершения ремонта оборудование пройдеттестирование, чтобы убедиться в
						его исправности, и будет возвращено вам готовым к эксплуатации.
					</li>
				</ul>
				<h2>
					Поддержка и консультации
				</h2>
				<p className="garant__txt garant__txt2">
					На любом этапе оформления заявок в сервисные центры, а также по любым вопросам, связанным с обслуживанием
					и ремонтом майнингового оборудования, вы можете обратиться к личным менеджерам PitBit Mining. Мы всегда
					готовы помочь вам и обеспечить наилучший сервис.
				</p>
				<p className="garant__txt">
					Наша цель - сделать так, чтобы ваше майнинговое оборудование всегда работало на максимальной
					производительности, а вы могли сосредоточиться на развитии своего бизнеса, доверив все вопросы
					обслуживания нам.
				</p>
				<div className="garant-faq">
					<h2>
						Ответы на часто задаваемые вопросы:
					</h2>
					<div className="accordeon">
						<div className="accordeon-container">
							<li className="accordeon__item">
								<div className="accordeon__button closed">Какие поломки не попадают под действие гарантии? Какие
									действия с аппаратом могут лишить гарантии?</div>
								<ul className="accordeon__panel">
									<li className="panel__text">
										<p className="panel__info">
											Самые распространенные случаи лишения гарантии - смешанные платы и повреждения,
											вызванные неправильной эксплуатацией устройства. Так, если Вы хотите "сэкономить" и
											прислать в сервисный центр один аппарат с неисправными компонентами из других
											устройств, в системе Bitmain будет видно, что платы не совпадает, и устройство
											автоматически лишается гарантии. Если же на ваших платах видны следы прогаров,
											окисления, повреждены дороги или взорваны чипы - это может свидетельствовать как и о
											разгоне, так и об использовании неоригинального БП. Во всех таких случаях мы отправляем
											фотографии для подтверждения в Bitmain, после чего проходит списание устройства с
											гарантии и возвращение клиенту за его счет. Еще одна частая причина лишения гарантии -
											использование неоригинального ПО, включая прошивки которые можно запустить с флеш-карты
										</p>
									</li>
								</ul>
							</li>
							<li className="accordeon__item">
								<div className="accordeon__button closed">Если поломка не является гарантийной и/или у аппарата
									кончилась гарантия, могу ли я заплатить за ремонт?</div>
								<ul className="accordeon__panel">
									<li className="panel__text">
										<p className="panel__info">
											Самые распространенные случаи лишения гарантии - смешанные платы и повреждения,
											вызванные неправильной эксплуатацией устройства. Так, если Вы хотите "сэкономить" и
											прислать в сервисный центр один аппарат с неисправными компонентами из других
											устройств, в системе Bitmain будет видно, что платы не совпадает, и устройство
											автоматически лишается гарантии. Если же на ваших платах видны следы прогаров,
											окисления, повреждены дороги или взорваны чипы - это может свидетельствовать как и о
											разгоне, так и об использовании неоригинального БП. Во всех таких случаях мы отправляем
											фотографии для подтверждения в Bitmain, после чего проходит списание устройства с
											гарантии и возвращение клиенту за его счет. Еще одна частая причина лишения гарантии -
											использование неоригинального ПО, включая прошивки которые можно запустить с флеш-карты
										</p>
									</li>
								</ul>
							</li>
							<li className="accordeon__item">
								<div className="accordeon__button closed">Я хочу сам привезти и сдать оборудование в сервисный центр
									в Иркутске или Москве, как мне это сделать?</div>
								<ul className="accordeon__panel">
									<li className="panel__text">
										<p className="panel__info">
											Самые распространенные случаи лишения гарантии - смешанные платы и повреждения,
											вызванные неправильной эксплуатацией устройства. Так, если Вы хотите "сэкономить" и
											прислать в сервисный центр один аппарат с неисправными компонентами из других
											устройств, в системе Bitmain будет видно, что платы не совпадает, и устройство
											автоматически лишается гарантии. Если же на ваших платах видны следы прогаров,
											окисления, повреждены дороги или взорваны чипы - это может свидетельствовать как и о
											разгоне, так и об использовании неоригинального БП. Во всех таких случаях мы отправляем
											фотографии для подтверждения в Bitmain, после чего проходит списание устройства с
											гарантии и возвращение клиенту за его счет. Еще одна частая причина лишения гарантии -
											использование неоригинального ПО, включая прошивки которые можно запустить с флеш-карты
										</p>
									</li>
								</ul>
							</li>
						</div>
					</div>
				</div>
				
			</div>
		</section>
		<section className="call" id="call">
			<div className="container">
				<div className="call__wrap">
					<picture>
						<source srcSet="img/call2.png" media="(max-width: 1200px)"/>
						<img src="img/call1.png" alt="" className="call__bg"/>
					</picture>
					<div className="call__content">
						<p className="call__title">
							Получите <br/>
							профессиональную консультацию<span>.</span>
						</p>
						<p className="call__txt">
							Оставьте заявку, и наши менеджеры свяжутся с Вами для <br/> проведения консультации
						</p>
					</div>
					<div className="call__area">
						<h2>
							Оставьте заявку
						</h2>
						<p>Нажимая на кнопку, вы отправите <br/> 
          заполненную вашими регистрационнымыми данными заявку
          </p>
          <small>Доступно только авторизованным пользователям</small>
						<form action="#" className="call__form">
							
							<button className="btn btn_2"
							type='button'
							onClick={sendMessageToTelegram}>
								{buttonText}
							</button>
							<p>
								Нажимая на кнопку я подтверждаю, что ознакомлен и согласен с <br/> <a href="/policy" target="_blank">
									уловиями политики
									конфиденциальности</a>
							</p>
						</form>
					</div>
				</div>
			</div>
		</section>
    </>
  );
}

export default GuaranteePage;
